# №1

In [1]:
h <- c(8, 10, NA, NA, 8, NA, 8)
h

[1]  8 10 NA NA  8 NA  8

In [2]:
mean(h, na.rm=TRUE)

[1] 8.5

In [3]:
mean(na.omit(h))

[1] 8.5

In [4]:
h[is.na(h)] <- mean(h, na.rm=TRUE)
h

[1]  8.0 10.0  8.5  8.5  8.0  8.5  8.0

In [5]:
mean(h)

[1] 8.5

# №2

In [6]:
city <- c("City1", "City1", "City2", "City2", "City3", "City3")
gender <- c("Male", "Female", "Male", "Female", "Male", "Female")
number <- c(12150, 23210, 14353, 22022, 11388, 54334)
CITY <- data.frame(City=city, Gender=gender, Number=number)
CITY

  City  Gender Number
1 City1 Male   12150
2 City1 Female 23210
3 City2 Male   14353
4 City2 Female 22022
5 City3 Male   11388
6 City3 Female 54334

In [7]:
CITY$City <- c("Kyiv", "Kharkiv", "Lviv", "Dnipro", "Vinnytsia", "Donetsk")
CITY

  City      Gender Number
1 Kyiv      Male   12150
2 Kharkiv   Female 23210
3 Lviv      Male   14353
4 Dnipro    Female 22022
5 Vinnytsia Male   11388
6 Donetsk   Female 54334

# №3

In [2]:
library("readxl")

In [4]:
warriors <- read_excel("warriors.xlsx")
warriors

   Name     Age Weight Height Blood group Rhesus factor
1  Ivan     23  80     178    2           0
2  Peter    18  62     168    1           0
3  Oleg     22  77     185    2           0
4  Sergey   19  73     182    2           1
5  Vladimir 20  65     166    1           1
6  Alexey   19  90     185    1           0
7  Alexandr 21  89     182    2           1
8  Boris    18  59     172    4           1
9  Igor     23  75     175    3           1
10 Artem    18  69     176    2           0
11 Andrey   20  81     184    3           0
12 Viktor   19  74     177    2           0
13 Stepan   22  85     187    3           0
14 Grigoriy 23  65     170    1           1
15 Fedor    21  74     179    2           1
16 Anatoliy 19  76     178    1           0
17 Gleb     21  80     184    2           1
18 Anton    18  63     174    3           0

In [8]:
warriors$Weight <- as.integer(warriors$Weight)
warriors$Height <- as.integer(warriors$Height)
troopers <- warriors[warriors$Age >= 23L,]
troopers

  Name     Age Weight Height Blood group Rhesus factor
1 Ivan     23  80     178    2           0
2 Igor     23  75     175    3           1
3 Grigoriy 23  65     170    1           1

# №4

In [20]:
students <- data.frame(
    FullName=c("Goncharuk Alexey Ivanovich", "Bardash Eugene Petrovich", "Haritonskiy Vitaliy Alexandrovich", "Vozna Olena Viktorivna"),
    Department=c("Mathematics", "Geography", "Geography", "Economics"),
    Form=c("Contract", "Budget", "Budget", "Budget"),
    Specialization=c("Applied Math", "Geology", "Meteorology", "Macroeconomics"),
    Exam1=c(3, 4, 5, 3),
    Exam2=c(4, 3, 4, 5),
    Exam3=c(5, 5, 3, 3),
    Exam4=c(4, 4, 4, 3)
)

In [12]:
cat(mean(students$Exam1), mean(students$Exam2), mean(students$Exam3), mean(students$Exam4))

3.75 4 4 3.75

In [13]:
mode <- function(x) {
  ux <- unique(x)
  ux[which.max(tabulate(match(x, ux)))]
}

In [18]:
cat(mode(students$Exam1), mode(students$Exam2), mode(students$Exam3), mode(students$Exam4))

3 4 5 4

In [24]:
selection <- students[(students$Form != "Contract") & (students$Department != "Economics"),]
selection

  FullName                          Department Form   Specialization Exam1
2 Bardash Eugene Petrovich          Geography  Budget Geology        4
3 Haritonskiy Vitaliy Alexandrovich Geography  Budget Meteorology    5
  Exam2 Exam3 Exam4
2 3     5     4
3 4     3     4

In [25]:
cat(mean(selection$Exam1), mean(selection$Exam2), mean(selection$Exam3), mean(selection$Exam4))

4.5 3.5 4 4

In [26]:
cat(mode(selection$Exam1), mode(selection$Exam2), mode(selection$Exam3), mode(selection$Exam4))

4 3 5 4